Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ospi.c
struct stm32l4_ospidev_s
{
  struct ospi_dev_s ospi;       /* Externally visible part of the OSPI interface */
  uint32_t base;                /* OSPI controller register base address */
  uint32_t frequency;           /* Requested clock frequency */
  uint32_t actual;              /* Actual clock frequency */
  uint8_t mode;                 /* Mode 0,3 */
  uint8_t nbits;                /* Width of word in bits (8 to 32) */
  uint8_t intf;                 /* OSPI controller number (0) */
  bool initialized;             /* TRUE: Controller has been initialized */
  sem_t exclsem;                /* Assures mutually exclusive access to OSPI */
  bool memmap;                  /* TRUE: Controller is in memory mapped mode */

#define STM32L4_OSPI_INTERRUPTS
#ifdef STM32L4_OSPI_INTERRUPTS
  xcpt_t handler;               /* Interrupt handler */
  uint8_t irq;                  /* Interrupt number */
  sem_t op_sem;                 /* Block until complete */
  struct ospi_xctnspec_s *xctn; /* context of transaction in progress */
#endif


#ifdef CONFIG_STM32L4_OSPI_DMA
  bool candma;                  /* DMA is supported */
  sem_t dmawait;                /* Used to wait for DMA completion */
  int result;                   /* DMA result */
  DMA_HANDLE dmach;             /* OSPI DMA handle */
  WDOG_ID dmadog;               /* Watchdog that handles DMA timeouts */
#endif

  /* Debug stuff */

#ifdef CONFIG_STM32L4_OSPI_DMADEBUG
  struct stm32l4_dmaregs_s dmaregs[DMA_NSAMPLES];
#endif

#ifdef CONFIG_STM32L4_OSPI_REGDEBUG
   bool     wrlast;            /* Last was a write */
   uint32_t addresslast;       /* Last address */
   uint32_t valuelast;         /* Last value */
   int      ntimes;            /* Number of times */
#endif
};


static const struct ospi_ops_s g_ospi0ops =
{
  .lock              = ospi_lock,
  .setfrequency      = ospi_setfrequency,
  .setmode           = ospi_setmode,
  .setbits           = ospi_setbits,
  .command           = ospi_command,
  .memory            = ospi_memory,
  .alloc             = ospi_alloc,
  .free              = ospi_free,
};


static struct stm32l4_ospidev_s g_ospi0dev =
{
  .ospi            =
  {
    .ops             = &g_ospi0ops,
  },
  .base              = STM32L4_OCTOSPI1_BASE,
#ifdef STM32L4_OSPI_INTERRUPTS
  .handler           = ospi0_interrupt,
  .irq               = STM32L4_IRQ_OCTOSPI1,
#endif
  .intf              = 0,
#ifdef CONFIG_STM32L4_OSPI_DMA
  .candma            = true,
#endif
};

static int ospi_lock(struct ospi_dev_s *dev, bool lock)
{
  return 0;
}

static uint32_t ospi_setfrequency(struct ospi_dev_s *dev, uint32_t frequency)
{
  return 0;
}

static void ospi_setmode(struct ospi_dev_s *dev, enum ospi_mode_e mode)
{

}

static void ospi_setbits(struct ospi_dev_s *dev, int nbits)
{

}

static int ospi_command(struct ospi_dev_s *dev, struct ospi_cmdinfo_s *cmdinfo)
{
  return 0;
}
#ifdef BSP_OSPI_MEMORY_MAPPED_ENABLE
#define MEMORY_MAPPED_OFF   (0x00)
#define MEMORY_MAPPED_ON    (0x01)
static int ospi_memory(struct ospi_dev_s *dev, struct ospi_meminfo_s *meminfo)
{
  static uint8_t mode = MEMORY_MAPPED_OFF;

  OSPI_RegularCmdTypeDef sCommand;

  /* octo spi write mode*/
  if (OSPIMEM_ISWRITE(meminfo->flags))
  {
    uint8_t* pData     = (uint8_t *)meminfo->buffer;
    uint32_t WriteAddr = meminfo->addr;
    uint32_t Size      = meminfo->buflen;
    uint8_t *mem_addr;
    uint32_t end_addr, current_size, current_addr;

    /* Calculation of the size between the write address and the end of the page */
    current_size = MX25LM51245G_PAGE_SIZE - (WriteAddr % MX25LM51245G_PAGE_SIZE);

    /* Check if the size of the data is less than the remaining place in the page */
    if (current_size > Size)
    {
      current_size = Size;
    }

    /* Initialize the adress variables */
    current_addr = WriteAddr;
    end_addr = WriteAddr + Size;

    if(mode == MEMORY_MAPPED_ON)
    {
      if(stm32l4_ospi_exit_memorymapped((struct ospi_dev_s *)&g_ospi0dev, NULL, 0) != OSPI_NOR_OK)
      {
        return OSPI_NOR_ERROR;
      }
      mode = MEMORY_MAPPED_OFF;
    }

  /* Initialize the program command */
    sCommand.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
    sCommand.FlashId               = HAL_OSPI_FLASH_ID_1;
    sCommand.Instruction           = OCTAL_PAGE_PROG_CMD;
    sCommand.InstructionMode       = HAL_OSPI_INSTRUCTION_8_LINES;
    sCommand.InstructionSize       = HAL_OSPI_INSTRUCTION_16_BITS;
    sCommand.AddressMode           = HAL_OSPI_ADDRESS_8_LINES;
    sCommand.AddressSize           = HAL_OSPI_ADDRESS_32_BITS;
    sCommand.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
    sCommand.DataMode              = HAL_OSPI_DATA_8_LINES;
    sCommand.DummyCycles           = 0;
    sCommand.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;

   #if defined BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
    sCommand.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;
    sCommand.DQSMode               = HAL_OSPI_DQS_DISABLE;
   #else
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_ENABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_ENABLE;
    sCommand.DataDtrMode           = HAL_OSPI_DATA_DTR_ENABLE;
    sCommand.DQSMode               = HAL_OSPI_DQS_ENABLE;
   #endif

    /* Perform the write page by page */
    do
    {
      sCommand.Address = current_addr;
      sCommand.NbData  = current_size;

      /* Enable write operations */
      if (OSPI_NOR_WriteEnable(&OSPINORHandle) != OSPI_NOR_OK)
      {
        printf("Flash OSPI_NOR_WriteEnable error write status : 0x%x\n", OSPINORHandle.State);
        return OSPI_NOR_ERROR;
      }

      /* Configure the command */
      if (HAL_OSPI_Command(&OSPINORHandle, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        printf("Flash HAL_OSPI_Command error write status : 0x%x\n", OSPINORHandle.State);
        return OSPI_NOR_ERROR;
      }

      /* Transmission of the data */
      if (HAL_OSPI_Transmit(&OSPINORHandle, pData, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        printf("Flash HAL_OSPI_Transmit error write status : 0x%x\n", OSPINORHandle.State);
        return OSPI_NOR_ERROR;
      }

      /* Configure automatic polling mode to wait for end of program */
      if (OSPI_NOR_AutoPollingMemReady(&OSPINORHandle, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != OSPI_NOR_OK)
      {
        printf("Flash OSPI_NOR_AutoPollingMemReady error write status : 0x%x\n", OSPINORHandle.State);
        return OSPI_NOR_ERROR;
      }

      /* Update the address and size variables for next page programming */
      current_addr += current_size;
      pData += current_size;
      current_size = ((current_addr + MX25LM51245G_PAGE_SIZE) > end_addr) ? (end_addr - current_addr) : MX25LM51245G_PAGE_SIZE;
    } while (current_addr < end_addr);


    return OSPI_NOR_OK;
  }
  /* octo spi read mode*/
  else if(OSPIMEM_ISREAD(meminfo->flags))
  {
    uint8_t* pData    = (uint8_t *)meminfo->buffer;
    uint32_t ReadAddr = meminfo->addr;
    uint32_t Size     = meminfo->buflen;
    uint8_t *mem_addr;

    if(mode == MEMORY_MAPPED_OFF)
    {
      if(stm32l4_ospi_enter_memorymapped((struct ospi_dev_s *)&g_ospi0dev, NULL, 0) != OSPI_NOR_OK)
      {
        return OSPI_NOR_ERROR;
      }
      mode = MEMORY_MAPPED_ON;
    }

