Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ospi.c
    mem_addr = (uint8_t *)(OCTOSPI1_BASE + ReadAddr);
    for (int index = 0; index < Size; index++)
    {
      *pData = *mem_addr;

      mem_addr++;
      pData++;
    }

    return OSPI_NOR_OK;
  }
  /* octo spi block erase mode*/
  else if(OSPIMEM_ISERASEBLCK(meminfo->flags))
  {
    uint32_t BlockAddress = meminfo->addr;

    if(mode == MEMORY_MAPPED_ON)
    {
      if(stm32l4_ospi_exit_memorymapped((struct ospi_dev_s *)&g_ospi0dev, NULL, 0) != OSPI_NOR_OK)
      {
        return OSPI_NOR_ERROR;
      }
      mode = MEMORY_MAPPED_OFF;
    }

    sCommand.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
    sCommand.FlashId               = HAL_OSPI_FLASH_ID_1;
    sCommand.Instruction           = OCTAL_BLOCK_ERASE_CMD;
    sCommand.InstructionMode       = HAL_OSPI_INSTRUCTION_8_LINES;
    sCommand.InstructionSize       = HAL_OSPI_INSTRUCTION_16_BITS;
    sCommand.Address               = BlockAddress;
    sCommand.AddressMode           = HAL_OSPI_ADDRESS_8_LINES;
    sCommand.AddressSize           = HAL_OSPI_ADDRESS_32_BITS;
    sCommand.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
    sCommand.DataMode              = HAL_OSPI_DATA_NONE;
    sCommand.DummyCycles           = 0;
    sCommand.DQSMode               = HAL_OSPI_DQS_DISABLE;
    sCommand.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;

  #if defined BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
  #else
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_ENABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_ENABLE;
  #endif

    /* Enable write operations */
    if (OSPI_NOR_WriteEnable(&OSPINORHandle) != OSPI_NOR_OK)
    {
      return OSPI_NOR_ERROR;
    }

    /* Send the command */
    if (HAL_OSPI_Command(&OSPINORHandle, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return OSPI_NOR_ERROR;
    }

    /* Configure automatic polling mode to wait for end of erase */
    if (OSPI_NOR_AutoPollingMemReady(&OSPINORHandle, MX25LM51245G_BLOCK_ERASE_MAX_TIME) != OSPI_NOR_OK)
    {
      return OSPI_NOR_ERROR;
    }

    return OSPI_NOR_OK;
  }
  /* octo spi sector erase mode*/
  else
  {
    uint32_t Sector = meminfo->addr;

    if (Sector >= (uint32_t)(MX25LM51245G_FLASH_SIZE/MX25LM51245G_SECTOR_SIZE))
    {
      return OSPI_NOR_ERROR;
    }

    if(mode == MEMORY_MAPPED_ON)
    {
      if(stm32l4_ospi_exit_memorymapped((struct ospi_dev_s *)&g_ospi0dev, NULL, 0) != OSPI_NOR_OK)
      {
        return OSPI_NOR_ERROR;
      }
      mode = MEMORY_MAPPED_OFF;
    }

    /* Initialize the erase command */
    sCommand.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
    sCommand.FlashId               = HAL_OSPI_FLASH_ID_1;
    sCommand.Instruction           = OCTAL_SECTOR_ERASE_CMD;
    sCommand.InstructionMode       = HAL_OSPI_INSTRUCTION_8_LINES;
    sCommand.InstructionSize       = HAL_OSPI_INSTRUCTION_16_BITS;
    sCommand.Address               = (Sector * MX25LM51245G_SECTOR_SIZE);
    sCommand.AddressMode           = HAL_OSPI_ADDRESS_8_LINES;
    sCommand.AddressSize           = HAL_OSPI_ADDRESS_32_BITS;
    sCommand.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
    sCommand.DataMode              = HAL_OSPI_DATA_NONE;
    sCommand.DummyCycles           = 0;
    sCommand.DQSMode               = HAL_OSPI_DQS_DISABLE;
    sCommand.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;

  #if defined BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
  #else
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_ENABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_ENABLE;
  #endif

    /* Enable write operations */
    if (OSPI_NOR_WriteEnable(&OSPINORHandle) != OSPI_NOR_OK)
    {
      printf("Flash OSPI_NOR_WriteEnable erase error status : 0x%x\n", OSPINORHandle.State);
      return OSPI_NOR_ERROR;
    }

    /* Send the command */
    if (HAL_OSPI_Command(&OSPINORHandle, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      printf("Flash HAL_OSPI_Command erase error status : 0x%x\n", OSPINORHandle.State);
      return OSPI_NOR_ERROR;
    }

    /* Configure automatic polling mode to wait for end of erase */
    if (OSPI_NOR_AutoPollingMemReady(&OSPINORHandle, MX25LM51245G_SECTOR_ERASE_MAX_TIME) != OSPI_NOR_OK)
    {
      printf("Flash OSPI_NOR_AutoPollingMemReady erase error status : 0x%x\n", OSPINORHandle.State);
      return OSPI_NOR_ERROR;
    }

    return OSPI_NOR_OK;
  }
}
#else
static int ospi_memory(struct ospi_dev_s *dev, struct ospi_meminfo_s *meminfo)
{
  OSPI_RegularCmdTypeDef sCommand;

  /* octo spi write mode*/
  if (OSPIMEM_ISWRITE(meminfo->flags))
  {
    uint8_t* pData     = (uint8_t *)meminfo->buffer;
    uint32_t WriteAddr = meminfo->addr;
    uint32_t Size      = meminfo->buflen;
    uint32_t end_addr, current_size, current_addr;

    /* Calculation of the size between the write address and the end of the page */
    current_size = MX25LM51245G_PAGE_SIZE - (WriteAddr % MX25LM51245G_PAGE_SIZE);

    /* Check if the size of the data is less than the remaining place in the page */
    if (current_size > Size)
    {
      current_size = Size;
    }

    /* Initialize the adress variables */
    current_addr = WriteAddr;
    end_addr = WriteAddr + Size;

    /* Initialize the program command */
    sCommand.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
    sCommand.FlashId               = HAL_OSPI_FLASH_ID_1;
    sCommand.Instruction           = OCTAL_PAGE_PROG_CMD;
    sCommand.InstructionMode       = HAL_OSPI_INSTRUCTION_8_LINES;
    sCommand.InstructionSize       = HAL_OSPI_INSTRUCTION_16_BITS;
    sCommand.AddressMode           = HAL_OSPI_ADDRESS_8_LINES;
    sCommand.AddressSize           = HAL_OSPI_ADDRESS_32_BITS;
    sCommand.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
    sCommand.DataMode              = HAL_OSPI_DATA_8_LINES;
    sCommand.DummyCycles           = 0;
    sCommand.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;

  #if defined BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
    sCommand.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;
    sCommand.DQSMode               = HAL_OSPI_DQS_DISABLE;
  #else
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_ENABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_ENABLE;
    sCommand.DataDtrMode           = HAL_OSPI_DATA_DTR_ENABLE;
    sCommand.DQSMode               = HAL_OSPI_DQS_ENABLE;
  #endif

    /* Perform the write page by page */
    do
    {
      sCommand.Address = current_addr;
      sCommand.NbData  = current_size;

      /* Enable write operations */
      if (OSPI_NOR_WriteEnable(&OSPINORHandle) != OSPI_NOR_OK)
      {
        printf("Flash OSPI_NOR_WriteEnable error write status : 0x%x\n", OSPINORHandle.State);
        return OSPI_NOR_ERROR;
      }

      /* Configure the command */
      if (HAL_OSPI_Command(&OSPINORHandle, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        printf("Flash HAL_OSPI_Command error write status : 0x%x\n", OSPINORHandle.State);
        return OSPI_NOR_ERROR;
      }

      /* Transmission of the data */
      if (HAL_OSPI_Transmit(&OSPINORHandle, pData, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        printf("Flash HAL_OSPI_Transmit error write status : 0x%x\n", OSPINORHandle.State);
        return OSPI_NOR_ERROR;
      }

      /* Configure automatic polling mode to wait for end of program */
      if (OSPI_NOR_AutoPollingMemReady(&OSPINORHandle, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != OSPI_NOR_OK)
      {
        printf("Flash OSPI_NOR_AutoPollingMemReady error write status : 0x%x\n", OSPINORHandle.State);
        return OSPI_NOR_ERROR;
      }

      /* Update the address and size variables for next page programming */
      current_addr += current_size;
      pData += current_size;
      current_size = ((current_addr + MX25LM51245G_PAGE_SIZE) > end_addr) ? (end_addr - current_addr) : MX25LM51245G_PAGE_SIZE;
    } while (current_addr < end_addr);

    return OSPI_NOR_OK;
  }
  /* octo spi read mode*/
  else if(OSPIMEM_ISREAD(meminfo->flags))
  {
    uint8_t* pData    = (uint8_t *)meminfo->buffer;
    uint32_t ReadAddr = meminfo->addr;
    uint32_t Size     = meminfo->buflen;

    /* Initialize the read command */
    sCommand.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
    sCommand.FlashId               = HAL_OSPI_FLASH_ID_1;
    sCommand.InstructionMode       = HAL_OSPI_INSTRUCTION_8_LINES;
    sCommand.InstructionSize       = HAL_OSPI_INSTRUCTION_16_BITS;
    sCommand.Address               = ReadAddr;
    sCommand.AddressMode           = HAL_OSPI_ADDRESS_8_LINES;
    sCommand.AddressSize           = HAL_OSPI_ADDRESS_32_BITS;
    sCommand.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
    sCommand.DataMode              = HAL_OSPI_DATA_8_LINES;
    sCommand.NbData                = Size;
    sCommand.DummyCycles           = DUMMY_CYCLES_READ_OCTAL;
    sCommand.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;

  #if defined BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
    sCommand.Instruction           = OCTAL_IO_READ_CMD;
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
    sCommand.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;
    sCommand.DQSMode               = HAL_OSPI_DQS_DISABLE;
  #else
    sCommand.Instruction           = OCTAL_IO_DTR_READ_CMD;
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_ENABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_ENABLE;
    sCommand.DataDtrMode           = HAL_OSPI_DATA_DTR_ENABLE;
    sCommand.DQSMode               = HAL_OSPI_DQS_ENABLE;
  #endif

    /* Configure the command */
    if (HAL_OSPI_Command(&OSPINORHandle, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      printf("Flash HAL_OSPI_Command read error status : 0x%x\n", OSPINORHandle.State);
      return OSPI_NOR_ERROR;
    }

    /* Reception of the data */
    if (HAL_OSPI_Receive(&OSPINORHandle, pData, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      printf("Flash HAL_OSPI_Receive read error status : 0x%x\n", OSPINORHandle.State);
      return OSPI_NOR_ERROR;
    }
#ifndef BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
    *(volatile uint32_t *)(0xA0001400) |= 0x02;
    //volatile uint32_t dRead = *(volatile uint32_t *)(0xA0001450);
#endif
    return OSPI_NOR_OK;
  }
  /* octo spi block erase mode*/
  else if(OSPIMEM_ISERASEBLCK(meminfo->flags))
  {
    uint32_t BlockAddress = meminfo->addr;

    /* Initialize the erase command */
    sCommand.OperationType         = HAL_OSPI_OPTYPE_COMMON_CFG;
    sCommand.FlashId               = HAL_OSPI_FLASH_ID_1;
    sCommand.Instruction           = OCTAL_BLOCK_ERASE_CMD;
    sCommand.InstructionMode       = HAL_OSPI_INSTRUCTION_8_LINES;
    sCommand.InstructionSize       = HAL_OSPI_INSTRUCTION_16_BITS;
    sCommand.Address               = BlockAddress;
    sCommand.AddressMode           = HAL_OSPI_ADDRESS_8_LINES;
    sCommand.AddressSize           = HAL_OSPI_ADDRESS_32_BITS;
    sCommand.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
    sCommand.DataMode              = HAL_OSPI_DATA_NONE;
    sCommand.DummyCycles           = 0;
    sCommand.DQSMode               = HAL_OSPI_DQS_DISABLE;
    sCommand.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;

  #if defined BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
  #else
    sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_ENABLE;
    sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_ENABLE;
  #endif

    /* Enable write operations */
    if (OSPI_NOR_WriteEnable(&OSPINORHandle) != OSPI_NOR_OK)
    {
      return OSPI_NOR_ERROR;
    }

