Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ospi.c
  if (intf == 0)
  {
    priv = &g_ospi0dev;

    if (!priv->initialized)
    {
      priv->initialized = true;
      priv->memmap = false;
  #ifdef STM32L4_OSPI_INTERRUPTS
      irq_attach(priv->irq, priv->handler, NULL);
  #endif
    }

    OSPIM_CfgTypeDef OSPIM_Cfg_Struct;

    OSPINORHandle.Instance = OCTOSPI1;

    /* Call the DeInit function to reset the driver */
    if (HAL_OSPI_DeInit(&OSPINORHandle) != HAL_OK)
    {
      Error_Handler(OSPI_NOR_ERROR);
      return NULL;
    }

    /* System level initialization */
    OSPI_NOR_MspInit();

    /* OctoSPI initialization */
    OSPINORHandle.Init.FifoThreshold         = 4;
    OSPINORHandle.Init.DualQuad              = HAL_OSPI_DUALQUAD_DISABLE;
    OSPINORHandle.Init.DeviceSize            = POSITION_VAL(MX25LM51245G_FLASH_SIZE); /* 512 MBits */
    OSPINORHandle.Init.ChipSelectHighTime    = 2;
    OSPINORHandle.Init.FreeRunningClock      = HAL_OSPI_FREERUNCLK_DISABLE;
    OSPINORHandle.Init.ClockMode             = HAL_OSPI_CLOCK_MODE_0;
    OSPINORHandle.Init.WrapSize              = HAL_OSPI_WRAP_NOT_SUPPORTED;
    OSPINORHandle.Init.ClockPrescaler        = 2; /* OctoSPI clock = 120MHz / ClockPrescaler = 60MHz */
    OSPINORHandle.Init.SampleShifting        = HAL_OSPI_SAMPLE_SHIFTING_NONE;
    #if defined BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
    OSPINORHandle.Init.MemoryType            = HAL_OSPI_MEMTYPE_MICRON;
    OSPINORHandle.Init.DelayHoldQuarterCycle = HAL_OSPI_DHQC_DISABLE;
    #else
    OSPINORHandle.Init.MemoryType            = HAL_OSPI_MEMTYPE_MACRONIX;
    OSPINORHandle.Init.DelayHoldQuarterCycle = HAL_OSPI_DHQC_ENABLE;
    #endif
    OSPINORHandle.Init.ChipSelectBoundary    = 0;

    if (HAL_OSPI_Init(&OSPINORHandle) != HAL_OK)
    {
      Error_Handler(OSPI_NOR_ERROR);
      return NULL;
    }

    /* OctoSPI IO Manager configuration */
    OSPIM_Cfg_Struct.ClkPort    = 2;
    OSPIM_Cfg_Struct.DQSPort    = 2;
    OSPIM_Cfg_Struct.IOHighPort = HAL_OSPIM_IOPORT_2_HIGH;
    OSPIM_Cfg_Struct.IOLowPort  = HAL_OSPIM_IOPORT_2_LOW;
    OSPIM_Cfg_Struct.NCSPort    = 2;

    if (HAL_OSPIM_Config(&OSPINORHandle, &OSPIM_Cfg_Struct, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      Error_Handler(OSPI_NOR_ERROR);
      return NULL;
    }

    /* OctoSPI memory reset */
    if (OSPI_NOR_ResetMemory(&OSPINORHandle) != OSPI_NOR_OK)
    {
      Error_Handler(OSPI_NOR_NOT_SUPPORTED);
      return NULL;
    }

    /* Insert delay */
    HAL_Delay(1);

    /* OctoSPI octal enable */
    if (OSPI_NOR_OctalMode(&OSPINORHandle, OSPI_NOR_OCTAL_ENABLE) != OSPI_NOR_OK)
    {
      Error_Handler(OSPI_NOR_ERROR);
      return NULL;
    }

    return &priv->ospi;
  }
  else
  {
    printf("ERROR: OSPI%d not supported\n", intf);
    return NULL;
  }

  return NULL;
}



/****************************************************************************
 * Name: stm32l4_ospi_enter_memorymapped
 *
 * Description:
 *   Put the OSPI device into memory mapped mode
 *
 * Input Parameters:
 *   dev - OSPI device
 *   meminfo - parameters like for a memory transfer used for reading
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

int stm32l4_ospi_enter_memorymapped(struct ospi_dev_s *dev,
                                     const struct ospi_meminfo_s *meminfo,
                                     uint32_t lpto)
{
  OSPI_RegularCmdTypeDef   sCommand;
  OSPI_MemoryMappedTypeDef sMemMappedCfg;

  /* Enable write operations */
  if (OSPI_NOR_WriteEnable(&OSPINORHandle) != OSPI_NOR_OK)
  {
    Error_Handler(OSPI_NOR_ERROR+1);
  }

  /* Configure the command for the read instruction */
  sCommand.OperationType         = HAL_OSPI_OPTYPE_READ_CFG;
  sCommand.FlashId               = HAL_OSPI_FLASH_ID_1;
  sCommand.InstructionMode       = HAL_OSPI_INSTRUCTION_8_LINES;
  sCommand.InstructionSize       = HAL_OSPI_INSTRUCTION_16_BITS;
  sCommand.AddressMode           = HAL_OSPI_ADDRESS_8_LINES;
  sCommand.AddressSize           = HAL_OSPI_ADDRESS_32_BITS;
  sCommand.AlternateBytesMode    = HAL_OSPI_ALTERNATE_BYTES_NONE;
  sCommand.DataMode              = HAL_OSPI_DATA_8_LINES;
  sCommand.DummyCycles           = DUMMY_CYCLES_READ_OCTAL;
  sCommand.SIOOMode              = HAL_OSPI_SIOO_INST_EVERY_CMD;

#if defined BSP_OSPI_NOR_DDR_MODE_DEACTIVATED
  sCommand.Instruction           = OCTAL_IO_READ_CMD;
  sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_DISABLE;
  sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_DISABLE;
  sCommand.DataDtrMode           = HAL_OSPI_DATA_DTR_DISABLE;
  sCommand.DQSMode               = HAL_OSPI_DQS_DISABLE;
#else
  sCommand.Instruction           = OCTAL_IO_DTR_READ_CMD;
  sCommand.InstructionDtrMode    = HAL_OSPI_INSTRUCTION_DTR_ENABLE;
  sCommand.AddressDtrMode        = HAL_OSPI_ADDRESS_DTR_ENABLE;
  sCommand.DataDtrMode           = HAL_OSPI_DATA_DTR_ENABLE;
  sCommand.DQSMode               = HAL_OSPI_DQS_ENABLE;
#endif

  if (HAL_OSPI_Command(&OSPINORHandle, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler(OSPI_NOR_ERROR+2);
  }

  /* Configure the command for the write instruction */
  sCommand.OperationType         = HAL_OSPI_OPTYPE_WRITE_CFG;
  sCommand.Instruction           = OCTAL_PAGE_PROG_CMD;
  sCommand.DummyCycles           = 0;

  if (HAL_OSPI_Command(&OSPINORHandle, &sCommand, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    Error_Handler(OSPI_NOR_ERROR+3);
  }

   /* Configure the memory mapped mode */
  sMemMappedCfg.TimeOutActivation = HAL_OSPI_TIMEOUT_COUNTER_DISABLE;

  if (HAL_OSPI_MemoryMapped(&OSPINORHandle, &sMemMappedCfg) != HAL_OK)
  {
    Error_Handler(OSPI_NOR_ERROR+4);
  }

  return OSPI_NOR_OK;
}

/****************************************************************************
 * Name: stm32l4_ospi_exit_memorymapped
 *
 * Description:
 *   Take the OSPI device out of memory mapped mode
 *
 * Input Parameters:
 *   dev - OSPI device
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

