Samsung/TizenRT/os/arch/arm/src/stm32l4/stm32l4_ospi.c
int stm32l4_ospi_exit_memorymapped(struct ospi_dev_s *dev)
{
  if(HAL_OSPI_Abort(&OSPINORHandle) != HAL_OK)
  {
    return OSPI_NOR_ERROR;
  }
  return OSPI_NOR_OK;
}


/****************************************************************************
 * Name: up_flashinitialize
 *
 * Description:
 *   Put the OSPI device into memory mapped mode
 *
 * Input Parameters:
 *   dev - OSPI device
 *   meminfo - parameters like for a memory transfer used for reading
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
static int this_erase(FAR struct mtd_dev_s *dev, off_t startblock, size_t nblocks)
{
  struct ospi_meminfo_s meminfo;
  int ret;

  for(int i=0; i<nblocks; i++)
  {
    meminfo.flags = OSPIMEM_ERASESECT;
    meminfo.addr = startblock + i;
    ret = ospi_memory((struct ospi_dev_s *)&g_ospi0dev, &meminfo);
  }
  //printf("this_erase startblock:%d, nblocks:%d\n", startblock, nblocks);

  if(ret == OSPI_NOR_OK)
    return nblocks;

  return 0;
}

static ssize_t this_bread(FAR struct mtd_dev_s *dev, off_t startblock, size_t nblocks, FAR uint8_t *buffer)
{
  struct ospi_meminfo_s meminfo;

  meminfo.flags = OSPIMEM_READ;
  meminfo.addr = startblock * MX25LM51245G_SECTOR_SIZE;
  meminfo.buffer = (uint8_t*)buffer;
  meminfo.buflen = nblocks * MX25LM51245G_SECTOR_SIZE;

  int ret = ospi_memory((struct ospi_dev_s *)&g_ospi0dev, &meminfo);

  //printf("this_bread ret:%d, startblock:%d, nblocks:%d\n", ret, startblock, nblocks);

  if(ret == OSPI_NOR_OK)
    return  nblocks;

  return 0;
}
static ssize_t this_bwrite(FAR struct mtd_dev_s *dev, off_t startblock, size_t nblocks, FAR const uint8_t *buffer)
{
  struct ospi_meminfo_s meminfo;

  meminfo.flags = OSPIMEM_WRITE;
  meminfo.addr = startblock * MX25LM51245G_SECTOR_SIZE;
  meminfo.buffer = (uint8_t*)buffer;
  meminfo.buflen = nblocks * MX25LM51245G_SECTOR_SIZE;

  int ret = ospi_memory((struct ospi_dev_s *)&g_ospi0dev, &meminfo);

  //printf("this_bwrite ret:%d, startblock:%d, nblocks:%d\n", ret, startblock, nblocks);

  if(ret == OSPI_NOR_OK)
    return  nblocks;

  return 0;
}
static ssize_t this_read(FAR struct mtd_dev_s *dev, off_t offset, size_t nbytes, FAR uint8_t *buffer)
{
  struct ospi_meminfo_s meminfo;

  meminfo.flags = OSPIMEM_READ;
  meminfo.addr = offset;
  meminfo.buffer = (uint8_t*)buffer;
  meminfo.buflen = nbytes;

  int ret = ospi_memory((struct ospi_dev_s *)&g_ospi0dev, &meminfo);

  //printf("this_read ret:%d, offset:0x%08x, nbytes:%d\n", ret, offset, nbytes);

  if(ret == OSPI_NOR_OK)
    return nbytes;

  return 0;
}
static int this_ioctl(FAR struct mtd_dev_s *dev, int cmd, unsigned long arg)
{
  struct ospi_meminfo_s meminfo;

  switch (cmd)
  {
  case MTDIOC_GEOMETRY:
  {
    FAR struct mtd_geometry_s *geo = (FAR struct mtd_geometry_s *)((uintptr_t)arg);
    if(geo)
    {
      geo->blocksize = MX25LM51245G_SECTOR_SIZE;
      geo->erasesize = MX25LM51245G_SECTOR_SIZE;
      geo->neraseblocks = MX25LM51245G_FLASH_SIZE / MX25LM51245G_SECTOR_SIZE;
    }
    //printf("MTDIOC_GEOMETRY\n");
  }
    break;
  case MTDIOC_BULKERASE:
    //printf("MTDIOC_BULKERASE\n");
    break;

  case MTDIOC_XIPBASE:
    //printf("MTDIOC_XIPBASE\n");
    break;

  default:
    break;
  }

  return 0;
}
/****************************************************************************
 * Name: up_flashinitialize
 *
 * Description:
 *   Put the OSPI device into memory mapped mode
 *
 * Input Parameters:
 *   dev - OSPI device
 *   meminfo - parameters like for a memory transfer used for reading
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
FAR struct mtd_dev_s *up_flashinitialize(void)
{
  FAR struct mtd_dev_s *priv;
  priv = (FAR struct mtd_dev_s *)kmm_zalloc(sizeof(struct mtd_dev_s));

  if(priv)
  {
    priv->erase = this_erase;
    priv->bread = this_bread;
    priv->bwrite = this_bwrite;
    priv->read = this_read;
    priv->ioctl = this_ioctl;
#ifdef CONFIG_MTD_REGISTRATION
    priv->name = "stm32l4_flash";
#endif
  }

  return priv;
}














